Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། ཤཱ་རིའི་བུ་བསམ་པ་ཞེས་བྱ་བ་ནི་མི་ཕྱེད་པའི་ཕྱིར་སྙིང་པོའོ། ། བརྟེན་པའི་ཕྱིར་མི་ཕྱེད་པའོ། ། མི་གཡོ་བའི་ཕྱིར་བརྟན་པའོ། ། མ་འཁྲུལ་བའི་ཕྱིར་མི་གཡོ་བའོ། ། ཤིན་ཏུ་གནས་པའི་ཕྱིར་མ་འཁྲུལ་པའོ། ། མི་ཟློགས་པའི་ཕྱིར་ཤིན་ཏུ་གནས་པའོ། ། སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་མི་ཟློགས་པའོ། ། སྙིང་རྗེ་ཆེན་པོའི་རྩ་བ་ལས་བྱུང་བའི་ཕྱིར་སེམས་ཅན་ལ་ལྟ་བའོ། ། ཡོངས་སུ་མི་སྐྱོ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་རྩ་བའོ། ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཆོ་ག་ཤེས་པའི་ཕྱིར་ཡོངས་སུ་མི་སྐྱོ་བའོ། ། བདག་ལ་བདེ་བ་མ་ཡིན་པའི་ཕྱིར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཆོ་ག་ཤེས་པའོ། ། ལན་དུ་ཕན་འདོགས་པར་རེ་བ་མེད་པའི་ཕྱིར་བདག་བདེ་བ་མ་ཡིན་པའོ། ། ཟང་ཟིང་མེད་པའི་ཕྱིར་ལན་དུ་ཕན་འདོགས་པར་རེ་བ་མེད་པའོ། ། སེམས་ཅན་གྱི་ཕྱིར་འབྲང་བས་ཟང་ཟིང་མེད་པའོ། ། མཐུ་ཆུང་བའི་སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་སེམས་ཅན་གྱི་ཕྱིར་འབྲང་བའོ། ། མགོན་དུ་གྱུར་པའི་ཕྱིར་མཐུ་ཆུང་བའི་སེམས་ཅན་ལ་ལྟ་བའོ། ། སྐྱབས་དང་དཔུང་གཉེན་གྱི་ཕྱིར་མགོན་དུ་གྱུར་པའོ། ། མ་འཁྲུགས་པའི་ཕྱིར་སྐྱབས་དང་དཔུང་གཉེན་ནོ། ། ཤིན་ཏུ་ཡང་དག་པར་བརྟགས་པའི་ཕྱིར་མ་འཁྲུགས་པའོ། ། རྩོད་པ་མེད་པའི་ཕྱིར་ཤིན་ཏུ་ཡང་དག་པར་བརྟག་པའོ། ། བསམ་པ་དགེ་བའི་ཕྱིར་རྩོད་པ་མེད་པའོ། ། ཅི་ཡང་མེད་པའི་ཕྱིར་བསམ་པ་དགེ་བའོ། ། ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཅི་ཡང་མེད་པའོ། ། རབ་ཏུ་བྱུང་བར་བྱས་པའི་ཕྱིར་ཤིན་ཏུ་ཡོངས་སུ་དག་པའོ། ། ནང་དྲི་མ་མེད་པའི་ཕྱིར་རབ་ཏུ་བྱང་བར་བྱས་པའོ། ། ཕྱི་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཕྱིར་ནང་དྲི་མ་མེད་པའོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་མི་ཕྱེད་པས་སྙིང་པོ་ཞེས་བྱ་བ་ནས་ཕྱི་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཕྱིར་ནང་དྲི་མ་མེད་པའི་བར་དུ་སྟེ། བསམ་པ་ནི་དེ་ལྟ་བུའོ། །
en: The Lord then spoke to the venerable Śāriputra, “Śāriputra, here is why it is called a foundation of resolve. It is solid because it cannot be broken. It cannot be broken because it is firm. It is firm because it cannot be swayed. It cannot be swayed because it is not unsteady. It is not unsteady because it is well established. It is well established because it does not turn back. It does not turn back because it is concern for sentient beings. It is concern for sentient beings because it is rooted in great compassion. It is rooted in great compassion because it does not become weary. It does not become weary because it is knowledge of how to bring sentient beings to maturity. It is knowledge of how to bring sentient beings to maturity because it is not occupied with egocentric happiness. It is not occupied with egocentric happiness because it does not look for any reward. It does not look for any reward because it is not interested in material gain. It is not interested in material gain because of its support for sentient beings. It supports sentient beings because of its concern for the weak. It has concern for the weak and acts as a protector for them. It is able to protect them because it is a refuge and ultimate sanctuary. It is a refuge and ultimate sanctuary because it is unassailable. It is unassailable because it is well considered. It is well considered because it is beyond objectification. It is beyond objectification because of its virtuous resolve. Its resolve is virtuous because it is nothing in particular. It is nothing in particular because it is completely immaculate. It is completely immaculate because it is wholly purified. It is wholly purified because its inner nature is without blemish. Its inner nature is without blemish because it is externally immaculate. This, Śāriputra, is what this foundation of resolve is like: everything from solid and unbreakable to internally free of blemishes and externally immaculate.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཇི་ལྟ་བུ་ཞེ་ན། སེམས་དེ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བའོ། ། སེམས་དེ་ནི་ཐེག་པ་གཞན་མི་འདོད་པའི་ཕྱིར་འབྲེལ་བ་མེད་པའོ། ། སེམས་དེ་ནི་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པའི་ཕྱིར་བརྟན་པའོ། ། སེམས་དེ་ནི་བདུད་ཐམས་ཅད་ཀྱིས་མི་ཕྱེད་པའོ། ། སེམས་དེ་ནི་དགེ་བའི་རྩ་བའི་ཚོགས་བསགས་པའི་ཕྱིར་རྟག་པའོ། ། སེམས་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ལ་མོས་པའི་ཕྱིར་མི་གཡོ་བའོ། ། སེམས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་རབ་ཏུ་གནས་པའོ། ། སེམས་དེ་ནི་གཉེན་པོ་མེད་པའི་ཕྱིར་བླ་ན་མེད་པའོ། ། སེམས་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ངེས་པར་ཕིགས་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུའོ། ། སེམས་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་མི་མཉམ་པ་མེད་པའི་ཕྱིར་མཉམ་པའོ། ། སེམས་དེ་ནི་རང་བཞིན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་རྣམ་པར་དག་པའོ། ། སེམས་དེ་ནི་ཤེས་རབ་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་དྲི་མ་མེད་པའོ། ། སེམས་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྐབས་འབྱེད་པའི་ཕྱིར་རྒྱ་ཆེ་བའོ། ། སེམས་དེ་ནི་ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་ཡངས་པའོ། ། སེམས་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བཏང་བའི་ཕྱིར་སྒྲིབ་པ་མེད་པའོ། ། སེམས་དེ་ནི་སྙིང་རྗེ་ཆེན་པོ་མ་བཅད་པའི་ཕྱིར་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའོ། ། སེམས་དེ་ནི་མཁས་པས་བསྔགས་པའི་ཕྱིར་མངོན་དུ་འགྲོ་བར་བྱ་བའོ། ། སེམས་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ས་བོན་དུ་གྱུར་པའོ། ། སེམས་དེ་ནི་བདེ་བའི་དངོས་པོ་ཐམས་ཅད་ཀྱི་གནས་སོ། ། སེམས་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིས་སྨོན་ལམ་ལས་བྱུང་བའོ། ། སེམས་དེ་ནི་བཟོད་པས་བསྙེན་པར་དགའ་བའོ། ། སེམས་དེ་ནི་བརྩོན་འགྲུས་ཀྱིས་ཐུལ་བར་དཀའ་བའོ། ། སེམས་དེ་ནི་བསམ་གཏན་དག་གིས་ཉེ་བར་ཞི་བའོ། ། སེམས་དེ་ནི་ཤེས་རབ་ཀྱི་ཚོགས་ཀྱིས་གནོད་པ་མེད་པའོ། །
en: “What is the mind of awakening like? It is a mind that cannot be crushed by any vice. It is a mind that is unfettered because it is not inclined toward other paths. It is a mind that is stable, not led astray by any counterarguments. It is a mind that cannot be broken by any māras. It is a mind that is steadfast because it has accumulated a great many roots of virtue. It is a mind that is unwavering because it longs for the Buddha’s teaching. It is a mind that is firmly established on the stages of the bodhisatva path. It is a mind that is unsurpassed—it has no equal. It is a mind that is like a vajra because it can truly penetrate all the Buddha’s teachings. It is a mind that is balanced because it is impartial in relation to the inclinations of all sentient beings. It is a mind that is completely pure, free by its very nature from afflictive mental states. It is a mind that is stainless because it is illuminated by wisdom. It is a broad mind, as it has room for all sentient beings. It is an extensive, sky-like mind. It is an unobstructed mind because its focus is boundless knowledge. It is a mind that is omnipresent since it is never separated from great compassion. It is a mind one should seek to develop, because it is praised by the wise. It is a mind that is like the seed of all the Buddha’s teachings. It is a mind that is the basis of all genuine happiness. It is a mind that comes about through the diligent practice of morality. It is a mind that is difficult to attain, as it requires patience. It is a mind that is difficult to conquer because it is heroic. It is a mind that has been calmed by means of meditation. It is a mind that cannot be impaired because of its great wisdom.

source: ཡང་སེམས་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོའི་རྩ་བའོ། ། སེམས་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་ཕུང་པོའི་རྩ་བའོ། ། སེམས་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རྣམས་ཀྱི་རྩ་བའོ། །
en: “Also, it is a mind that is the root of the Tathāgata’s skandha of morality, his skandha of concentration, his skandha of wisdom, and his skandha of liberation. It is a mind that is the root of the Tathāgata’s skandha of insight into the knowledge of liberation. It is a mind that is the root of the ten powers of the Tathāgata, his four kinds of confidence, and his eighteen unique buddha qualities.

source: ཡང་ཤཱ་རིའི་བུ་སེམས་དེ་ནི་བྱང་ཆུབ་ཀྱི་རང་བཞིན་ཏེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་དེ་ལྟ་བུ་དང་ལྡན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། ། སེམས་རྒྱ་ཆེན་པོ་སེམས་ཅན་མཆོག་རབ་ཅེས་བྱའོ། ། འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་གྱུར་པའི་སེམས་ཅན་ཞེས་བྱའོ། ། ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཡིན། ངག་གི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཡིན། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཡིན། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་ཡིན། ངག་གི་ལས་ཡོངས་སུ་དག་པ་ཡིན། ཡིད་ཀྱི་ལས་ཡོངས་སུ་དག་པ་ཡིན། ལུས་ཀྱི་ལས་མ་གཡོས་པ་ཡིན། ངག་གི་ལས་མ་གཡོས་པ་ཡིན། ཡིད་ཀྱི་ལས་མ་གཡོས་པ་ཡིན་ཏེ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་ལས་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བསྐྱོད་མི་ནུས་པ་ཡིན། ས་ནས་སར་འཕར་བ་ལ་མཁས་པ་ཡིན། འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདྲེན་པར་གྱུར་པ་ཡིན། རྣམ་པར་འདྲེན་པར་གྱུར་པ་དང་། ཡོངས་སུ་འདྲེན་པར་གྱུར་པ་དང་། སྒྲོན་མར་གྱུར་པ་དང་། སྟེགས་སུ་གྱུར་པ་དང་། ཟམ་པར་གྱུར་པ་དང་། གྲུར་གྱུར་པ་དང་། སྒྲོལ་བར་གྱུར་པ་དང་། ཕ་རོལ་ཏུ་འགྲོ་བ་དང་། གནས་དང་། མགོན་དང་། སྐྱབས་དང་། དཔུང་གཉེན་ཡིན་ནོ། ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་ལས་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བསྐྱོད་པར་མི་ནུས་པ་ཡིན་ནོ། །
en: “Śāriputra, as awakening is the nature of this mind, it is called the mind of awakening. Śāriputra, a bodhisatva is someone who possesses the resolve that is the mind of awakening. It is because of this that he is called a bodhisatva, a being whose mind is exalted, a supreme being, a being of distinction in the threefold world. His bodily conduct is irreproachable. His verbal conduct is irreproachable. His mental conduct is irreproachable. His bodily conduct is undisturbed. His verbal conduct is undisturbed. His mental conduct is undisturbed. Neither Māra and his retinue nor the gods are able to disturb him when he has made up his mind to reach omniscience. He progresses with skill from stage to stage and is not soiled by worldly phenomena. He acts as a leader, and he acts as a mentor, a guide, a torch, a ford, a bridge, a boat, and a ferryman who carries living beings to the other shore. He is a resting place, a shelter, a refuge, and an ultimate sanctuary for all sentient beings. Neither Māra and his retinue nor the gods are able to turn him from his course when he has made up his mind to reach omniscience.

source: དེ་ལྟར་ན་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དད་པ་ཡིན་ནོ། ། དད་པ་མང་བ་དང་། འཕགས་པ་རྣམས་མཐོང་བར་འདོད་པ་དང་། ཆོས་ཉན་པར་འདོད་པ་ཡིན། སེར་སྣ་མེད་ཅིང་ལྷུག་པར་གཏོང་བ་དང་། ལག་བརྐྱང་ཞིང་རྣམ་པར་གཏོང་བ་ལ་དགའ་བ་དང་། སྦྱིན་པ་བགེད་པ་ལ་དགའ་བ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་ཡིན། རྙོག་པ་མེད་པའི་སེམས་དང་། འཁྲུགས་པ་མེད་པའི་སེམས་དང་། མ་འདྲེས་པའི་སེམས་དང་། དེ་ལས་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མངོན་པར་དད་པ་དང་། རབ་ཏུ་རྟོག་ཅིང་ཡིད་ཆེས་པ་དང་། ཐེ་ཚོམ་མེད་ཅིང་སོམ་ཉི་མེད་པ་ཡིན་ནོ། ། དེ་ནག་པོ་དང་། དཀར་པོའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུ་མི་སྟོར་བར་ཤེས་པས་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་པ་ཡིན་ཏེ། དེ་སྲོག་གཅོད་པ་སྤོང་བ་ཡིན། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་བ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྤོང་བ་ཡིན་ཏེ མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་སྤངས་ནས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་ལེན་ཅིང་སྤྱོད་དོ། །
en: “Śāriputra, the bodhisatva is intent on attaining unsurpassed genuine awakening. He trusts in this and is truly dedicated to it. He longs to see the noble ones. He longs to listen to the Dharma. He is not miserly but generous and open handed. He takes delight in giving and distributes his wealth with joy. He has no aversion to any sentient beings when he engages with them, but he has an unsullied mind, an unagitated mind, an unscattered mind. He has complete faith, confidence, and trust in karma and the ripening of its fruits and is free from doubt and uncertainty in this respect. He knows that the effects of negative and positive qualities will not vanish, and so he does not perform any evil acts, even at the cost of his own life. He does not take life, nor does he take anything that is not given, engage in sexual misconduct, lie, slander, speak coarsely, or chatter inanely, and he does not indulge in covetousness, in malice, or in wrong views. He abandons these ten unwholesome forms of conduct and instead practice the ten wholesome forms of conduct.

source: དེ་དད་པ་དང་ལྡན་པས་གང་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དག་ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། དགེ་བའི་ཆོས་ཅན་དང་། མང་དུ་ཐོས་པ་དང་། ཐོས་པ་ལ་བརྩོན་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་དང་། དུལ་བ་དང་། ཞི་བ་དང་། ཉེ་བར་ཞི་བ་དང་། རྩོད་པའི་སྨྲ་བ་མེད་པ་དང་། མི་སྙན་པར་སྨྲ་བ་མེད་པ་དང་། བསམ་པ་དགེ་ཞིང་མི་དགེ་བའི་བསམ་པ་མེད་པ་དང་། དགེ་བ་ལ་ཡང་དག་པར་སྦྱོར་བ་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ་དང་། རྒོད་པ་མེད་པ་དང་། ཁེངས་པ་མ་ཡིན་པ་དང་། ཡབ་ཡབ་པོ་མེད་པ་དང་། མུ་ཅོར་མི་སྨྲ་བ་དང་། ཚིག་མ་འདྲེས་པ་དང་། དྲན་པ་ཉེ་བར་གནས་པ་དང་། སེམས་ཤིན་ཏུ་མཉམ་པར་གཞག་པ་དེ་དག་དང་། ཇི་ལྟར་སྲིད་པར་འདྲེན་པ་བཅད་པ་དང་། ཟུག་རྔུ་ཕྱུང་བ་དང་། ཁུར་བོར་བ་དང་། ཐེ་ཚོམ་ལས་རྒལ་བ་དང་། སོམ་ཉི་ལས་རྒལ་བ་དང་། ཡང་སྲིད་པ་ཟད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དང་། དེ་ལྟ་བུའི་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དགེ་བའི་བཤེས་གཉེན་དུ་རིག་ནས་ དེ་དག་ལ་བསྙེན་ཅིང་བསྟེན་ཏེ བསྙེན་བཀུར་བྱེད་ཅིང་མགུ་བར་བྱེད་ཀྱི། ཡིད་བྱུང་བར་མི་བྱེད་དོ། ། དགའ་བར་བྱེད་ཀྱི། མི་དགའ་བར་མི་བྱེད་དོ། །
en: “He has reverence for ascetics and brahmins, for those whose practice is genuine, whose commitment is genuine, who uphold morality, who have good qualities, who are graceful, who are of good character, who are of great learning, who study diligently, who are concerned with what is essential, who are disciplined, peaceful, and tranquil, who do not engage in divisive speech, who do not engage in unfriendly speech, whose intentions are virtuous, who do not have unwholesome intentions, who are inseparable from what is wholesome, who avoid all unwholesome acts, who are not conceited, who are not arrogant, who are not fickle, who are not overly talkative, who do not babble, who are mindful, whose minds are focused, who have cut off that which leads to existence, who have removed their arrows, who have cast off their burden, who have left their uncertainty behind, and who are beyond doubt, for lords, buddhas, who are beyond rebirth, and for the bodhisatvas, the great beings, the disciples of the Buddha. When he meets ascetics, brahmins, and spiritual friends such as these, he honors them, serves them, attends to them, and pleases them—he does not ignore them. He treats them well and is not unpleasant to them.

source: དེས་དགེ་བའི་བཤེས་གཉེན་མགུ་བར་བྱས་པས་དེ་དག་དེ་ལ་ཆོས་ཀྱིས་ཕན་འདོགས་པར་བྱེད་དེ། ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་བྱེད། ། ཡང་དག་པར་འཛིན་དུ་འཇུག ། ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱེད་དེ། སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོ་འགྱུར་བ་དང་། ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་སུ་སྐྱེ་བ་དང་། ཐོས་པས་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་དང་། སྒོམ་པས་འབྲལ་བར་འགྱུར་རོ་ཞེས་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། ། འདི་ནི་སྦྱིན་པ། འདི་ནི་སྦྱིན་པའི་འབྲས་བུ་དང་། འདི་ནི་སེར་སྣ། འདི་ནི་སེར་སྣའི་འབྲས་བུ། འདི་ནི་ཚུལ་ཁྲིམས། འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་འཆལ་བའི་ཚུལ་ཁྲིམས། འདི་ནི་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་བཟོད་པ། འདི་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་གནོད་སེམས། འདི་ནི་གནོད་སེམས་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་བརྩོན་འགྲུས། འདི་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་ལེ་ལོ། འདི་ནི་ལེ་ལོའི་རྣམ་པར་སྨིན་པ། འདི་ནི་བསམ་གཏན། འདི་ནི་བསམ་གཏན་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་སེམས་གཡེང་བ། འདི་ནི་སེམས་གཡེང་བའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ཤེས་རབ། འདི་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་འཆལ་བའི་ཤེས་རབ། འདི་ནི་འཆལ་བའི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པ། འདི་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ། འདི་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ། འདི་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ངག་གིས་ལེགས་པར་སྤྱོད་པ། འདི་ནི་ངག་གིས་ལེགས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ངག་གིས་ཉེས་པར་སྤྱོད་པ། འདི་ནི་ངག་གིས་ཉེས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ། འདི་ནི་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ། འདི་ནི་ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ། འདི་ནི་དགེ་བ། འདི་ནི་མི་དགེ་བ། འདི་ནི་བྱ་བ། འདི་ནི་མི་བྱ་བ། འདི་བྱས་ན་ ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་། བདེ་བར་འགྱུར། འདི་བྱས་ན་ ཡུན་རིང་པོར་གནོད་པ་དང་། མི་ཕན་པ་དང་། མི་བདེ་བར་འགྱུར་རོ་ཞེས་དེ་ལྟར་དེ་ལ་དགེ་བའི་བཤེས་གཉེན་དེ་དག་གིས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་ཏེ་ཡང་དག་པར་འཛིན་དུ་འཇུག།
en: “As he does not ignore these spiritual friends, they bless him with the Dharma, they explain the Dharma to him, they help him to understand, they inspire him, and they thrill him, saying, ‘Generosity results in great riches, morality leads to rebirth in the heavens, studying brings great knowledge, and meditation leads to liberation.’ This is how they teach him. ‘This is generosity. This is the fruit of generosity. This is miserliness. This is the fruit of miserliness. This is morality. This is the result of morality. This is immorality. This is the result of immorality. This is patience. This is the result of patience. This is malice. This is the result of malice. This is vigor. This is the result of vigor. This is laziness. This is the result of laziness. This is meditation. This is the result of meditation. This is the agitated mind. This is the result of the agitated mind. This is wisdom. This is the result of wisdom. This is misunderstanding. This is the result of misunderstanding. These are positive actions of the body. These are the results of positive actions of the body. These are negative actions of the body. These are the results of negative actions of the body. These are positive verbal actions. These are the results of positive verbal actions. These are negative verbal actions. These are the results of negative verbal actions. These are positive mental actions. These are the results of positive mental actions. These are negative mental actions. These are the results of negative mental actions. This is virtue. This is vice. This is what you should do. This is what you should not do. If you do this, it will benefit you, help you, and bring you long-lasting happiness. If you do this it will hurt you, harm you, and bring you sorrow for a long time.’

source: ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱེད་དེ། སྣོད་དུ་གྱུར་པར་ཡང་ཤེས་ནས་ཟབ་མོའི་གཏམ་ཡང་དག་པར་འཛིན་དུ་འཇུག་སྟེ། འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་གཏམ་དང་། མཚན་མ་མེད་པའི་གཏམ་དང་། སྨོན་པ་མེད་པའི་གཏམ་དང་། །མངོན་པར་འདུ་མི་བྱེད་པའི་གཏམ་དང་། མ་སྐྱེས་པའི་གཏམ་དང་། མ་བྱུང་བའི་གཏམ་དང་། བདག་མེད་པའི་གཏམ་དང་། སེམས་ཅན་མེད་པའི་གཏམ་དང་། སྲོག་མེད་པའི་གཏམ་དང་། གང་ཟག་མེད་པའི་གཏམ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོའི་གཏམ་རབ་ཏུ་སྟོན་ཏོ། ། འདི་ལྟ་སྟེ། འདི་ཡོད་པས་འདི་འབྱུང་། འདི་སྐྱེས་པའི་ཕྱིར་འདི་སྐྱེ་བ་སྟེ། འདི་ལྟར་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ། རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུགས་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་འབའ་ཤིག་འབྱུང་བར་འགྱུར་རོ། ། འདི་ལྟ་སྟེ། འདི་མེད་ན་འདི་མི་འབྱུང་། འདི་འགགས་པས་འདི་འགག་སྟེ། འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་པ་ནས། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་འབའ་ཤིག་འགག་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: “This is how his spiritual friends instruct him, help him to understand, inspire him, and thrill him. They see that he is worthy to receive the profound teaching, and so they impart it to him: the teaching of emptiness, the teaching on the freedom from attributes, the teaching of freedom from aspirations, the teaching of the conditionless, the teaching of the unborn, the teaching of nonarising, the teaching of no self, no being, and no life force, the teaching of no person, the profound teaching, the teaching of dependent origination. That is to say, when this is, that comes to be. When this has arisen, that arises. When the condition of ignorance is present, there is mental conditioning. When the condition of mental conditioning is present, there is consciousness. When the condition of consciousness is present, there is name and form. When the condition of name and form is present, there are the six sense fields. When the condition of the six sense fields is present, there is contact. When the condition of contact is present, there is feeling. When the condition of feeling is present, there is desire. When the condition of desire is present, there is grasping. When the condition of grasping is present, there is becoming. When the condition of becoming is present, there is birth. When the condition of birth is present, there is aging, death, pain, despair, suffering, depression, and struggle. This is how the whole great mass of suffering comes about. When this is not, that does not come to be. When this has ceased, that will cease. When ignorance has ceased, mental conditioning will cease, and so forth. In this way the whole great mass of suffering ceases.

source: འདི་ལ་ནི་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟེ། བདག་པོ་མེད་པ། བྱེད་པ་པོ་མེད་པ། ཚོར་བ་པོ་མེད་པ། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བ་སྟེ། འདི་ལ་ཆོས་གང་ཡང་འགྲུབ་པ་མེད། ལྡོག་པ་མེད། རྗེས་སུ་འཇུག་པ་མེད་དེ། ཡང་དག་པ་མ་ཡིན་པའི་རྨོངས་པས་ཁམས་གསུམ་འདོགས་པར་འགྱུར་རོ། ། ཉོན་མོངས་པའི་ལམ་དང་། སྡུག་བསྔལ་གྱི་ལམ་འདོགས་པར་འགྱུར་རོ། ། ཡང་དག་པ་མ་ཡིན་པའི་རྨོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟགས་ནས་ཆོས་གང་ཡང་ཆོས་གང་གི་བྱེད་པ་པོ་མ་ཡིན་ནོ། ། གང་ལ་བྱེད་པ་པོ་མེད་པ་དེ་ལ་དོན་དམ་པ་བྱ་བ་ཡང་མི་དམིགས་ཏེ། དེ་ལ་ཆོས་གང་ཡང་འབྱུང་བ་མེད། འཇིག་པ་མེད་དོ་ཞེས་བརྗོད་དོ། །
en: “In fact, it is not possible to find any phenomenon that comes into being or disappears. Why is this? All phenomena originate interdependently; they have no owner, no creator, no experiencer. They come about in dependence upon causes and conditions. There is no phenomenon that develops, that changes, or that reoccurs. It is the delusion that trusts what is false that leads one to designate the three realms and the ways of vice and suffering that manifest. When this false delusion is seen for what it truly is, there are no phenomena and no creator of any phenomena. Where there is no creator, one is also, ultimately, not able to find any activity or any phenomena that occur or cease. This is how they instruct him.

source: དེས་དེ་ལྟ་བུའི་ཆོས་ཟབ་མོ་ཐོས་ནས་ཐེ་ཚོམ་མི་ཟ། སོམ་ཉི་མི་བྱེད་ཅིང་ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པར་འཇུག་སྟེ། དེ་གཟུགས་ལ་མི་ཆགས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས། མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་དང་། ཆོས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས་ཏེ། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པའོ་ཞེས་དད་དོ། །
en: “When he has listened to such profound teachings, he harbors no doubt or uncertainty but engage with everything free of attachment. He does not cling to form and does not cling to feeling, perception, mental conditioning, or consciousness. He does not cling to the eye, to form, or to visual consciousness. He does not cling to the ear, the nose, the tongue, the body, the mind, mental objects, or mental consciousness. He is confident of the empty nature of all phenomena.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་དད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ལ་ལྟ་བ་ལས་ཡོངས་སུ་མི་ཉམས། ཆོས་ཉན་པ་ལས་ཡོངས་སུ་མི་ཉམས། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་ལས་ཡོངས་སུ་མི་ཉམས་སོ། ། དེ་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ་སངས་རྒྱས་ལ་ལྟ་བ་དང་བྲལ་བར་མི་འགྱུར། ཆོས་ཉན་པ་དང་བྲལ་བར་མི་འགྱུར། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་བྲལ་བར་མི་འགྱུར། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱན་སྔར་སྐྱེ་བར་འགྱུར་ཏེ། དེ་དང་དེ་དག་ཏུ་སྐྱེས་ནས་ཀྱང་བརྩོན་འགྲུས་རྩོམ་ཞིང་དགེ་བའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པར་འགྱུར་རོ། ། དེ་བརྩོན་འགྲུས་བརྩམས་པས་ཁྱིམ་གྱི་གནས་མི་འདོད་པར་འགྱུར། བུ་ཕོ་དང་། བུ་མོ་འདོད་པར་མི་འགྱུར། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་དག་མི་འདོད་པར་འགྱུར།
en: “Śāriputra, with his firm confidence the bodhisatva does not give up seeing the Buddha, does not give up listening to the Dharma, and does not give up engaging with the Saṅgha. Wherever he practices, he is not deprived of seeing the Buddha, not deprived of listening to the Dharma, and not deprived of engaging with the Saṅgha. He appears in the presence of the lords, the buddhas, and applies himself with diligence in their company, endeavoring to live with virtue. Applying himself with diligence in this way, he no longer wishes for a household. He no longer wishes for children and a wife. He no longer wishes for male and female servants, workers, or laborers. He no longer wishes for all the troubles that come with possessions.
